---
kind: enumMember
id: F:Autodesk.Revit.DB.LeaderAtachement.TopLine
enum: Autodesk.Revit.DB.LeaderAtachement
source: html/82ed0368-6da3-53a3-8c07-4061efd0be56.htm
---
# Autodesk.Revit.DB.LeaderAtachement.TopLine

Leaders are attached at the position of the top (first) line of the text box,
 and, unless the text's border is visible, the leader's shoulder line extends
 all the way to the text, minus the current value of text border offset.